brew 'mas' # Command line tools for app store https://github.com/mas-cli/mas

# Terminal
brew 'starship'
tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# Tool for writing to ntfs drives
#cask 'osxfuse' # required for ntfs-3g
#brew gromgit/fuse/ntfs-3g-mac
#brew 'ntfs-3g'

# Company Tools
cask 'google-drive'
cask 'microsoft-office'
mas 'Slack', id: 803453959 # will fail on first install, apps must be 'purchased' manually first
mas 'menu-world-time', id: 1446377255

# Source control
brew 'git'
cask 'sourcetree'

#brew 'ansible'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'opera'
cask 'tor-browser'
cask 'brave-browser'

#cask 'silverlight'

cask 'authy'

cask 'iterm2' # Terminal emulator

cask 'flux' # Adjust screen colour temperature

cask 'vlc' # Video player

# Virtual Machines
#cask 'virtualbox'
#cask 'homebrew/cask-versions/virtualbox-beta'
#cask 'virtualbox-extension-pack'
#cask 'vagrant'

# Remote Desktop
#cask 'microsoft-remote-desktop-beta'

# Docker tools
#cask 'docker', restart_service: true
#brew 'docker-compose'
brew 'docker'
brew 'lima'
brew 'colima'

# Kubernetes tools
brew 'kubernetes-cli'
brew 'helm'
brew 'kubectx'
tap 'blendle/blendle'
brew 'kns'
tap 'johanhaleby/kubetail'
brew 'kubetail'
brew 'kind'
brew 'kustomize'
brew 'stern'
brew 'istioctl'
brew 'pcre'

# ME Bank SSO Login Kubernetes
#tap 'int128/kubelogin'
#brew 'kubelogin'

# IDE / Text Editor
cask 'sublime-text'
cask 'intellij-idea'
cask 'visual-studio-code'

mas 'LastPass', id: 926036361 # Password manager

brew 'python'
brew 'awscli'
cask 'google-cloud-sdk'

#mas 'Noizio', id: 928871589

cask 'appcleaner'

cask 'nordvpn'

brew 'dos2unix'

cask 'calibre'

#System debugging
cask 'launchcontrol'

#brew 'antigen'

#cask 'discord'

brew 'imagemagick'

cask 'stats'

cask 'lulu'

